# Chapter 3 - Ex3: Combining Data
Câu 1: Illinois Male Baby Names 
Cho dữ liệu 201*-baby-names-illinois.csv. Bộ dữ liệu này thống kê tần suất các tên gọi được đặt. 
* Đọc dữ liệu 
* Xem xét vấn đề về dữ liệu cần khắc phục 
* Chuẩn lại dữ liệu để khắc phục vấn đề trên

In [1]:
import pandas as pd
import numpy as np
import glob as gl

In [7]:
allFile = gl.glob("201*-baby-names-illinois.csv")
df_lst = []
for ten_file in allFile:
    df = pd.read_csv(ten_file,index_col=0,header=0)
    print(ten_file,df.shape)
    df.columns = map(str.lower,df.columns)
    df['Year'] = ten_file[0:4]
    df_lst.append(df)

2014-baby-names-illinois.csv (101, 3)
2015-baby-names-illinois.csv (100, 3)
           name  frequency   sex  Year
rank
1          Noah        863  Male  2015
2          Liam        709  Male  2015
3     Alexander        703  Male  2015
4         Jacob        650  Male  2015
5       William        618  Male  2015
...         ...        ...   ...   ...
96     Giovanni        168  Male  2015
97       Hudson        167  Male  2015
98       Camden        165  Male  2015
99          Max        164  Male  2015
100     Maxwell        155  Male  2015

[100 rows x 4 columns]

In [9]:
df = pd.concat(df_lst).reset_index()
df

     rank       name  frequency   sex  Year
0       1       Noah        837  Male  2014
1       2  Alexander        747  Male  2014
2       3    William        687  Male  2014
3       4    Michael        680  Male  2014
4       5       Liam        670  Male  2014
..    ...        ...        ...   ...   ...
196    96   Giovanni        168  Male  2015
197    97     Hudson        167  Male  2015
198    98     Camden        165  Male  2015
199    99        Max        164  Male  2015
200   100    Maxwell        155  Male  2015

[201 rows x 5 columns]

In [11]:
df.shape

(201, 5)